#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
Acquiring state lock. This may take a few moments...
module.gcr.google_project_service.api["containerregistry.googleapis.com"]: Refreshing state... [id=tbd-2023z-303748/containerregistry.googleapis.com]
module.vpc.module.vpc.module.vpc.google_compute_network.network: Refreshing state... [id=projects/tbd-2023z-303748/global/networks/main-vpc]
module.data-pipelines.google_storage_bucket.tbd-code-bucket: Refreshing state... [id=tbd-2023z-303748-code]
module.data-pipelines.google_storage_bucket.tbd-data-bucket: Refreshing state... [id=tbd-2023z-303748-data]
module.vpc.google_compute_firewall.default-internal-allow-all: Refreshing state... [id=projects/tbd-2023z-303748/global/firewalls/default-internal-allow-all]
module.vpc.google_compute_firewall.fw-allow-ingress-from-iap: Refreshing state... [id=projects/tbd-2023z-303748/global/firewalls/fw-allow-ingress-iap]
module.vpc.module.cloud-router.google_compute_router.router: Refreshing state... [id=projects/tbd-2023z-303748/regions/europe-west1/routers/nat-router]
module.vpc.module.vpc.module.subnets.google_compute_subnetwork.subnetwork["europe-west1/subnet-01"]: Refreshing state... [id=projects/tbd-2023z-303748/regions/europe-west1/subnetworks/subnet-01]
module.vpc.module.cloud-router.google_compute_router_nat.nats["nat-gateway"]: Refreshing state... [id=tbd-2023z-303748/europe-west1/nat-router/nat-gateway]
module.vpc.module.vpc.module.routes.google_compute_route.route["egress-internet"]: Refreshing state... [id=projects/tbd-2023z-303748/global/routes/egress-internet]
module.data-pipelines.google_storage_bucket_object.job-code["spark-job.py"]: Refreshing state... [id=tbd-2023z-303748-code-spark-job.py]
module.dataproc.google_project_service.dataproc: Refreshing state... [id=tbd-2023z-303748/dataproc.googleapis.com]
module.composer.google_compute_subnetwork.composer-subnet: Refreshing state... [id=projects/tbd-2023z-303748/regions/europe-west1/subnetworks/composer-subnet-01]
module.composer.google_service_account.tbd-composer-sa: Refreshing state... [id=projects/tbd-2023z-303748/serviceAccounts/tbd-2023z-303748-data@tbd-2023z-303748.iam.gserviceaccount.com]
module.composer.google_project_service.api["composer.googleapis.com"]: Refreshing state... [id=tbd-2023z-303748/composer.googleapis.com]
module.composer.google_project_iam_member.dataproc-sa-user-iam: Refreshing state... [id=tbd-2023z-303748/roles/iam.serviceAccountUser/serviceAccount:tbd-2023z-303748-data@tbd-2023z-303748.iam.gserviceaccount.com]
module.data-pipelines.google_storage_bucket_iam_member.tbd-code-bucket-iam-viewer: Refreshing state... [id=b/tbd-2023z-303748-code/roles/storage.objectViewer/serviceAccount:tbd-2023z-303748-data@tbd-2023z-303748.iam.gserviceaccount.com]
module.composer.google_project_iam_member.composer-member: Refreshing state... [id=tbd-2023z-303748/roles/composer.worker/serviceAccount:tbd-2023z-303748-data@tbd-2023z-303748.iam.gserviceaccount.com]
module.data-pipelines.google_storage_bucket_iam_member.tbd-data-bucket-iam-editor: Refreshing state... [id=b/tbd-2023z-303748-data/roles/storage.objectUser/serviceAccount:tbd-2023z-303748-data@tbd-2023z-303748.iam.gserviceaccount.com]
module.composer.google_project_iam_member.dataproc-editor-iam: Refreshing state... [id=tbd-2023z-303748/roles/dataproc.editor/serviceAccount:tbd-2023z-303748-data@tbd-2023z-303748.iam.gserviceaccount.com]
module.gcr.google_container_registry.registry: Refreshing state... [id=eu.artifacts.tbd-2023z-303748.appspot.com]
module.composer.module.composer.data.google_project.project: Reading...
module.dataproc.google_dataproc_cluster.tbd-dataproc-cluster: Refreshing state... [id=projects/tbd-2023z-303748/regions/europe-west1/clusters/tbd-cluster]
module.jupyter_docker_image.docker_image.jupyter: Refreshing state... [id=sha256:02b7e5ac474bcb4ecd775e67b151adc4823970e06815428004b84e3c8bc1ef38eu.gcr.io/tbd-2023z-303748/jupyter:3.6.3]
module.jupyter_docker_image.docker_registry_image.jupyterlab: Refreshing state... [id=sha256:3bcad6ddc9fe6b79548840252fd7b5f86a8216853b9a58f4db520249c5cda8b7]
module.composer.module.composer.data.google_project.project: Read complete after 0s [id=projects/tbd-2023z-303748]
module.composer.module.composer.google_project_iam_member.composer_agent_service_account[0]: Refreshing state... [id=tbd-2023z-303748/roles/composer.ServiceAgentV2Ext/serviceAccount:service-975491508619@cloudcomposer-accounts.iam.gserviceaccount.com]
module.vertex_ai_workbench.google_project_service.notebooks: Refreshing state... [id=tbd-2023z-303748/notebooks.googleapis.com]
module.vertex_ai_workbench.google_project_iam_binding.token_creator_role: Refreshing state... [id=tbd-2023z-303748/roles/iam.serviceAccountTokenCreator]
module.vertex_ai_workbench.google_storage_bucket.notebook-conf-bucket: Refreshing state... [id=tbd-2023z-303748-conf]
module.vertex_ai_workbench.google_storage_bucket_iam_binding.binding: Refreshing state... [id=b/tbd-2023z-303748-conf/roles/storage.objectViewer]
module.vertex_ai_workbench.google_storage_bucket_object.post-startup: Refreshing state... [id=tbd-2023z-303748-conf-scripts/notebook_post_startup_script.sh]
module.composer.module.composer.google_composer_environment.composer_env: Refreshing state... [id=projects/tbd-2023z-303748/locations/europe-west1/environments/demo-lab]
module.data-pipelines.google_storage_bucket_object.dag-code["data-dag.py"]: Refreshing state... [id=europe-west1-demo-lab-3948b25c-bucket-dags/data-dag.py]
module.vertex_ai_workbench.google_notebooks_instance.tbd_notebook: Refreshing state... [id=projects/tbd-2023z-303748/locations/europe-west1-b/instances/tbd-2023z-303748-notebook]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.jupyter_docker_image.docker_image.jupyter has been deleted
  - resource "docker_image" "jupyter" {
        id       = "sha256:02b7e5ac474bcb4ecd775e67b151adc4823970e06815428004b84e3c8bc1ef38eu.gcr.io/tbd-2023z-303748/jupyter:3.6.3"
      - name     = "eu.gcr.io/tbd-2023z-303748/jupyter:3.6.3" -> null
        # (2 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
-/+ destroy and then create replacement
 <= read (data resources)

Terraform will perform the following actions:

  # module.jupyter_docker_image.docker_image.jupyter will be created
  + resource "docker_image" "jupyter" {
      + id          = (known after apply)
      + image_id    = (known after apply)
      + name        = "eu.gcr.io/tbd-2023z-303748/jupyter:3.6.3"
      + repo_digest = (known after apply)
      + triggers    = {
          + "dir_sha1" = "98b5648b76ecb399c72485825db65adcee65fa80"
        }

      + build {
          + build_args   = {
              + "JUPYTERLAB_VERSION" = "3.6.3"
              + "PROJECT_NAME"       = "tbd-2023z-303748"
            }
          + cache_from   = []
          + context      = "modules/docker_image/resources"
          + dockerfile   = "Dockerfile"
          + extra_hosts  = []
          + remove       = true
          + security_opt = []
          + tag          = [
              + "eu.gcr.io/tbd-2023z-303748/jupyter:latest",
            ]
        }
    }

  # module.vertex_ai_workbench.data.google_project.project will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "google_project" "project" {
      + auto_create_network = (known after apply)
      + billing_account     = (known after apply)
      + folder_id           = (known after apply)
      + id                  = (known after apply)
      + labels              = (known after apply)
      + name                = (known after apply)
      + number              = (known after apply)
      + org_id              = (known after apply)
      + project_id          = "tbd-2023z-303748"
      + skip_delete         = (known after apply)
    }

  # module.vertex_ai_workbench.google_notebooks_instance.tbd_notebook must be replaced
-/+ resource "google_notebooks_instance" "tbd_notebook" {
      ~ create_time            = "2023-12-03T18:48:29.834787244Z" -> (known after apply)
      ~ id                     = "projects/tbd-2023z-303748/locations/europe-west1-b/instances/tbd-2023z-303748-notebook" -> (known after apply)
      - install_gpu_driver     = false -> null
      ~ labels                 = {
          - "goog-caip-notebook" = ""
        } -> (known after apply)
      ~ metadata               = {
          + "notebook-disable-root" = "true"
            # (1 unchanged element hidden)
        }
        name                   = "tbd-2023z-303748-notebook"
      ~ network                = "https://www.googleapis.com/compute/v1/projects/tbd-2023z-303748/global/networks/main-vpc" -> "projects/tbd-2023z-303748/global/networks/main-vpc"
      ~ project                = "tbd-2023z-303748" -> (known after apply)
      + proxy_uri              = (known after apply)
      ~ service_account        = "975491508619-compute@developer.gserviceaccount.com" -> (known after apply)
      - service_account_scopes = [] -> null
      ~ state                  = "ACTIVE" -> (known after apply)
      ~ subnet                 = "https://www.googleapis.com/compute/v1/projects/tbd-2023z-303748/regions/europe-west1/subnetworks/subnet-01" -> "projects/tbd-2023z-303748/regions/europe-west1/subnetworks/subnet-01"
      - tags                   = [] -> null
      ~ update_time            = "2023-12-03T18:52:58.106838850Z" -> (known after apply)
        # (6 unchanged attributes hidden)

      ~ shielded_instance_config {
          ~ enable_secure_boot          = false -> true # forces replacement
            # (2 unchanged attributes hidden)
        }

        # (1 unchanged block hidden)
    }

  # module.vertex_ai_workbench.google_project_iam_binding.token_creator_role will be updated in-place
  ~ resource "google_project_iam_binding" "token_creator_role" {
        id      = "tbd-2023z-303748/roles/iam.serviceAccountTokenCreator"
      ~ members = [
          - "serviceAccount:975491508619-compute@developer.gserviceaccount.com",
        ] -> (known after apply)
        # (3 unchanged attributes hidden)
    }

  # module.vertex_ai_workbench.google_storage_bucket_iam_binding.binding will be updated in-place
  ~ resource "google_storage_bucket_iam_binding" "binding" {
        id      = "b/tbd-2023z-303748-conf/roles/storage.objectViewer"
      ~ members = [
          - "serviceAccount:975491508619-compute@developer.gserviceaccount.com",
        ] -> (known after apply)
        # (3 unchanged attributes hidden)
    }

Plan: 2 to add, 2 to change, 1 to destroy.

Warning: Value for undeclared variable

The root module does not declare a variable named "iac_service_account" but a
value was found in file "env/project.tfvars". If you meant to use this value,
add a "variable" block to the configuration.

To silence these warnings, use TF_VAR_... environment variables to provide
certain "global" settings to all configurations in your organization. To
reduce the verbosity of these warnings, use the -compact-warnings option.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pusher: @WojciechGierulski, Action: `pull_request`, Working Directory: ``, Workflow: `Tech Tests`*